<a href="https://colab.research.google.com/github/0HOON/Data-processing-with-Python/blob/master/pandas_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

pandas tutorial

In [0]:
import pandas as pd
import numpy as np

In [0]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [0]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.906756 -0.252130  1.148885 -1.413544
2013-01-02 -1.934310  0.569445  0.013709  0.076063
2013-01-03 -0.253918 -0.831925 -0.610376  0.758557
2013-01-04  1.199696  0.861454 -0.345518  0.955523
2013-01-05 -0.438273 -0.785108  1.592507 -0.693898
2013-01-06 -0.427065 -0.194948  1.859123  1.305106

In [0]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [0]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.460104 -0.105535  0.609721  0.164635
std    1.017035  0.694206  1.055833  1.050190
min   -1.934310 -0.831925 -0.610376 -1.413544
25%   -0.789636 -0.651864 -0.255712 -0.501408
50%   -0.432669 -0.223539  0.581297  0.417310
75%   -0.297205  0.378347  1.481601  0.906282
max    1.199696  0.861454  1.859123  1.305106

In [0]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04  1.199696  0.861454 -0.345518  0.955523
2013-01-02 -1.934310  0.569445  0.013709  0.076063
2013-01-06 -0.427065 -0.194948  1.859123  1.305106
2013-01-01 -0.906756 -0.252130  1.148885 -1.413544
2013-01-05 -0.438273 -0.785108  1.592507 -0.693898
2013-01-03 -0.253918 -0.831925 -0.610376  0.758557

In [0]:
df['B']

2013-01-01   -0.252130
2013-01-02    0.569445
2013-01-03   -0.831925
2013-01-04    0.861454
2013-01-05   -0.785108
2013-01-06   -0.194948
Freq: D, Name: B, dtype: float64

In [0]:
df['B'].head(3)

2013-01-01   -0.252130
2013-01-02    0.569445
2013-01-03   -0.831925
Freq: D, Name: B, dtype: float64

In [0]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.934310  0.569445  0.013709  0.076063
2013-01-03 -0.253918 -0.831925 -0.610376  0.758557
2013-01-04  1.199696  0.861454 -0.345518  0.955523

In [0]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.906756 -0.252130
2013-01-02 -1.934310  0.569445
2013-01-03 -0.253918 -0.831925
2013-01-04  1.199696  0.861454
2013-01-05 -0.438273 -0.785108
2013-01-06 -0.427065 -0.194948

In [0]:
df.loc[dates[0],'A']

-0.9067564882203898

In [0]:
df[dates[0],'A']

KeyError: ignored

In [0]:
df.iloc[3]

In [0]:
df.iloc[3:5,0:2]

In [0]:
df

In [0]:
df[df.A>0]

In [0]:
df[df>0]

In [0]:
df2 = df.copy()

In [0]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']
df2

In [0]:
df2['E'].isin(['two','four'])

In [0]:
df

In [0]:
df.apply(np.cumsum)

In [0]:
df

In [0]:
df.apply(lambda x: x.max() - x.min())

In [0]:
df1 = pd.DataFrame({'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3'],},
                    index=[0,1,2,3])
df2 = pd.DataFrame({'A' : ['A4','A5','A6','A7'],
                    'B' : ['B4','B5','B6','B7'],
                    'C' : ['C4','C5','C6','C7'],
                    'D' : ['D4','D5','D6','D7'],},
                    index=[4,5,6,7])
df3 = pd.DataFrame({'A' : ['A8','A9','A10','A11'],
                    'B' : ['B8','B9','B10','B11'],
                    'C' : ['C8','C9','C10','C11'],
                    'D' : ['D8','D9','D10','D11'],},
                    index=[8,9,10,11])
df1
df2
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [0]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [0]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [0]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [0]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [0]:
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [0]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [0]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [0]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [0]:
df4 = pd.DataFrame({'B' : ['B2','B3','B6','B7'],
                    'D' : ['D2','D3','D6','D7'],
                    'F' : ['F2','F3','F6','F7'],
                    'G' : ['G2','G4','G6','G7'],},
                    index=[2,3,6,7])
result = pd.concat([df1,df4], axis=1)
result

     A    B    C    D    B    D    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2   G2
3   A3   B3   C3   D3   B3   D3   F3   G4
6  NaN  NaN  NaN  NaN   B6   D6   F6   G6
7  NaN  NaN  NaN  NaN   B7   D7   F7   G7

In [0]:
result = pd.concat([df1,df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F   G
2  A2  B2  C2  D2  B2  D2  F2  G2
3  A3  B3  C3  D3  B3  D3  F3  G4

In [0]:
result = pd.concat([df1,df4], axis=1, join_axes=[df1.index])
result

    A   B   C   D    B    D    F    G
0  A0  B0  C0  D0  NaN  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2   G2
3  A3  B3  C3  D3   B3   D3   F3   G4

In [0]:
result = pd.concat([df1,df4], ignore_index=True)
result

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A   B    C   D    F    G
0   A0  B0   C0  D0  NaN  NaN
1   A1  B1   C1  D1  NaN  NaN
2   A2  B2   C2  D2  NaN  NaN
3   A3  B3   C3  D3  NaN  NaN
4  NaN  B2  NaN  D2   F2   G2
5  NaN  B3  NaN  D3   F3   G4
6  NaN  B6  NaN  D6   F6   G6
7  NaN  B7  NaN  D7   F7   G7

In [0]:
left = pd.DataFrame({'Key' : ['K0','K4','K2','K3'],
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3']})
right = pd.DataFrame({'Key' : ['K0','K1','K2','K3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3']})
left

  Key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [0]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [0]:
pd.merge(left, right, on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [0]:
pd.merge(left, right, on='Key', how='left')

  Key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [0]:
pd.merge(left, right, on='Key', how='right')

  Key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [0]:
pd.merge(left, right, on='Key', how='outer')

  Key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [0]:
pd.merge(left, right, on='Key', how='inner')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [0]:
pd.merge(left, right, on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3